tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Fast, Dynamic Programming Language
brew "julia"
# Network authentication protocol
brew "krb5"
# Pager program similar to more
brew "less"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@16"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Develop and deploy code with zero configuration
brew "railway"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Code-search similar to ack
brew "the_silver_searcher"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Terminal built on web technologies
cask "hyper"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# 2D game framework for Lua
cask "love"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
